/**
  ************************************************************
  ************************************************************
  ************************************************************
  *   文件名：   led.cpp
  *
  *   作者：     张继瑞
  *
  *   日期：     2016-11-30
  *
  *   版本：     V1.0
  *
  *   说明：     LED初始化，亮灭LED
  *
  *   修改记录： 
  ************************************************************
  ************************************************************
  ************************************************************
**/

//Arduino头文件
#include <Arduino.h>

//硬件驱动
#include "led.h"

/*
************************************************************
*   函数名称： Led_Init
*
*   函数功能： LED初始化
*
*   入口参数： 无
*
*   返回参数： 无
*
*   说明：     LED1-Pin13    LED2-Pin12
               高电平开灯   低电平关灯
************************************************************
*/
void LED_CLASS::Led_Init(void)
{

    pinMode(LED2_PIN, OUTPUT);
    pinMode(LED1_PIN, OUTPUT);
  
}

/*
************************************************************
*   函数名称： Led1_Set
*
*   函数功能： LED1控制
*
*   入口参数： status：LED_ON-开灯  LED_OFF-关灯
*
*   返回参数： 无
*
*   说明：   
************************************************************
*/
 void LED_CLASS::Led1_Set(bool status)
 {
  
      digitalWrite(LED1_PIN, status);
      LED_CLASS::led1Sta = status;
  
}

/*
************************************************************
*   函数名称： Led2_Set
*
*   函数功能： LED2控制
*
*   入口参数： status：LED_ON-开灯  LED_OFF-关灯
*
*   返回参数： 无
*
*   说明：   
************************************************************
*/
 void LED_CLASS::Led2_Set(bool status)
 {
  
      digitalWrite(LED2_PIN, status);
      LED_CLASS::led2Sta = status;
  
}

