/**
  ************************************************************
  ************************************************************
  ************************************************************
  * 文件名：  fault.c
  *
  * 作者：     张继瑞
  *
  * 日期：     2016-11-29
  *
  * 版本：     V1.0
  *
  * 说明：     网络状态错误处理
  *
  * 修改记录： 
  ************************************************************
  ************************************************************
  ************************************************************
**/

//Arduino头文件
#include <Arduino.h>

//硬件驱动
#include "light.h"

void LIGHT_CLASS::Light_Init(void)
{

    analogReference(INTERNAL);

}

void LIGHT_CLASS::Light_GetValue(void)
{

    LIGHT_CLASS::light = analogRead(LIGHT_PIN);

}
